# Homework 1:

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} df = pd.DataFrame(data)

* 1.Rename column names using function. "First Name" --> "first_name", "Age" --> "age
* 2.Print the first 3 rows of the DataFrame
* 3.Find the mean age of the individuals
* 4.Select and print only the 'Name' and 'City' columns
* 5.Add a new column 'Salary' with random salary values
* 6.Display summary statistics of the DataFrame

* Bismillah

In [19]:
import pandas as pd
import numpy as np
data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 'Age': [25, 30, 35, 40], 'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']}
df=pd.DataFrame(data)
df

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [7]:
df=df.rename(columns={'First Name':'first name','Age':'age'})
df

  first name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [11]:
#df[['first name','age','City']]
first_3 = df.head(3)
first_3

  first name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [14]:
mean_age = df['age'].mean()
mean_age

np.float64(32.5)

In [16]:
df[['first name','City']]

  first name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [22]:
df['Salary'] = np.random.randint(0, 100, size=len(df))
df

  First Name  Age           City  Salary
0      Alice   25       New York       5
1        Bob   30  San Francisco      67
2    Charlie   35    Los Angeles      29
3      David   40        Chicago      76

In [23]:
print(df.describe())

             Age     Salary
count   4.000000   4.000000
mean   32.500000  44.250000
std     6.454972  33.159966
min    25.000000   5.000000
25%    28.750000  23.000000
50%    32.500000  48.000000
75%    36.250000  69.250000
max    40.000000  76.000000

# Homework 2

In [25]:
data = {'Month': ['Jan', 'Feb', 'Mar', 'Apr'], 'Sales': [5000, 6000, 7500, 8000], 'Expenses': [3000,3500,4000,4500]}
sales = pd.DataFrame(data)
sales

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [28]:
max_sales = sales['Sales'].max()
max_expenses = sales['Expenses'].max()
print(max_sales,max_expenses)

8000 4500

In [29]:
min_sales = sales['Sales'].min()
min_expenses = sales['Expenses'].min()
print(min_sales,min_expenses)

5000 3000

In [30]:
mean_sales = sales['Sales'].mean()
mean_expenses = sales['Expenses'].mean()
print(mean_sales,mean_expenses)

6625.0 3750.0

# Homework 3

In [46]:
data = ({
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'], 
    'January': [1200, 200, 300, 150], 
    'February': [1300,220,320,160],
    'March': [1400,240,330,170],
    'April': [1500,250,350,180]
    })
info = pd.DataFrame(data)
info

        Category  January  February  March  April
0           Rent     1200      1300   1400   1500
1      Utilities      200       220    240    250
2      Groceries      300       320    330    350
3  Entertainment      150       160    170    180

In [50]:
data = ({
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'], 
    'January': [1200, 200, 300, 150], 
    'February': [1300,220,320,160],
    'March': [1400,240,330,170],
    'April': [1500,250,350,180]
    })
info = pd.DataFrame(data)
info

info = info.set_index('Category')

max_expenses = info.max(axis=1)  
print("Maximum expenses per category:")
print(max_expenses)

Maximum expenses per category:
Category
Rent             1500
Utilities         250
Groceries         350
Entertainment     180
dtype: int64

In [51]:
data = ({
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'], 
    'January': [1200, 200, 300, 150], 
    'February': [1300,220,320,160],
    'March': [1400,240,330,170],
    'April': [1500,250,350,180]
    })
info = pd.DataFrame(data)
info

info = info.set_index('Category')

min_expenses = info.min(axis=1)  
print("Minimum expenses per category:")
print(min_expenses)

Minimum expenses per category:
Category
Rent             1200
Utilities         200
Groceries         300
Entertainment     150
dtype: int64

In [52]:
data = ({
    'Category': ['Rent', 'Utilities', 'Groceries', 'Entertainment'], 
    'January': [1200, 200, 300, 150], 
    'February': [1300,220,320,160],
    'March': [1400,240,330,170],
    'April': [1500,250,350,180]
    })
info = pd.DataFrame(data)
info

info = info.set_index('Category')

mean_expenses = info.mean(axis=1)  
print("Maean expenses per category:")
print(mean_expenses)

Maean expenses per category:
Category
Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     165.0
dtype: float64